In [2]:
import pandas as pd
import numpy as np

In [4]:
# Crear un DataFrame
data = {"A":[1,2,np.nan,4],"B":[np.nan,2,3,4],"C":[1,2,3,np.nan]}

df = pd.DataFrame(data)

df

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  NaN  3.0  3.0
3  4.0  4.0  NaN

In [5]:
# Mostrar la máscara booleana de valores nulos

valores_nulos = pd.isna(df)

valores_nulos

       A      B      C
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

# Ejercicio 2: Eliminación de filas con valores nulos

In [6]:
# Eliminar filas con valores nulos

eliminar_filas_nulos = df.dropna()

eliminar_filas_nulos

     A    B    C
1  2.0  2.0  2.0

# Ejercicio 3: Rellenar valores nulos

In [7]:
# Rellenar valores nulos con 0

llenar_valores_nulos = df.fillna(0)

llenar_valores_nulos

     A    B    C
0  1.0  0.0  1.0
1  2.0  2.0  2.0
2  0.0  3.0  3.0
3  4.0  4.0  0.0

# Ejercicio 4: Eliminación de duplicados

In [9]:
# Crear un DataFrame de ejemplo con filas duplicadas
data = {'A': [1, 2, 2, 4], 'B': [5, 6, 6, 8], 'C': [9, 10, 10, 12]}
df1 = pd.DataFrame(data)

# Eliminar filas duplicadas

eliminar_filas_duplicadas = df1.drop_duplicates()

eliminar_filas_duplicadas

   A  B   C
0  1  5   9
1  2  6  10
3  4  8  12

# Ejercicio 5: Verificación de orden monotónico

In [11]:
# Crear una Serie de ejemplo
serie = pd.Series([1, 2, 3, 4, 5])

serie_monotonica = serie.is_monotonic_increasing

serie_monotonica

True

# Ejercicio 6: Interpolación de valores nulos

In [12]:
# Interpolar valores nulos

interpolar_valores_nulos = df.interpolate()

interpolar_valores_nulos

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  3.0  3.0  3.0
3  4.0  4.0  3.0

# Ejercicio 7: Verificación de valores únicos

In [16]:
# Crear una Serie de ejemplo

serie1 = pd.Series([1,2,2,3,3,2,1,1])

# Mostrar los valores únicos en la Serie

unicos_valores = serie1.unique()

unicos_valores

array([1, 2, 3], dtype=int64)

# Ejercicio 8: Verificación de valores no nulos en una Serie

In [17]:
# Crear una Serie de ejemplo con valores nulos

serie = pd.Series([1,2,np.nan,4])

# Verificar si la Serie tiene valores nulos

has_nans = serie.hasnans

has_nans

True

# Ejercicio 9: Eliminación de filas basadas en condiciones

In [18]:
eliminar_fila = df.dropna()

eliminar_fila

     A    B    C
1  2.0  2.0  2.0

# Ejercicio 10: Identificación de filas duplicadas

In [19]:
# Crear un DataFrame de ejemplo con filas duplicadas
data = {'A': [1, 2, 2, 4], 'B': [5, 6, 6, 8], 'C': [9, 10, 10, 12]}
df2 = pd.DataFrame(data)

mascara_booleana1 = df2.duplicated()

mascara_booleana1

0    False
1    False
2     True
3    False
dtype: bool

# Ejercicio 11: Rellenar valores nulos con la media

In [20]:
# Crear un DataFrame de ejemplo con valores nulos
data = {'A': [1, 2, np.nan, 4], 'B': [5, np.nan, 7, 8], 'C': [np.nan, 10, 11, 12]}
df3 = pd.DataFrame(data)

df3

     A    B     C
0  1.0  5.0   NaN
1  2.0  NaN  10.0
2  NaN  7.0  11.0
3  4.0  8.0  12.0

In [22]:
# Rellenar valores nulos con la media de cada columna

fila_media = df3.fillna(df.mean())

fila_media

          A    B     C
0  1.000000  5.0   2.0
1  2.000000  3.0  10.0
2  2.333333  7.0  11.0
3  4.000000  8.0  12.0

# Ejercicio 12: Eliminar filas con valores duplicados en una columna específica

In [26]:
# Crear un DataFrame de ejemplo
data = {'A': [1, 2, 2, 4], 'B': [5, 6, 6, 8], 'C': [9, 10, 11, 12]}
df4 = pd.DataFrame(data)

# Eliminar filas con valores duplicados en la columna 'A'

df_no_duplicados = df4.drop_duplicates(subset = "A")

df_no_duplicados

   A  B   C
0  1  5   9
1  2  6  10
3  4  8  12

# Ejercicio 13: Crear una nueva columna basada en condiciones

In [32]:
# Crear un DataFrame de ejemplo
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Score': [80, 65, 90]}
df5 = pd.DataFrame(data)

# Crear una nueva columna 'Resultado' basada en condiciones
df5['Resultado'] = np.where(df5['Score'] >= 70, 'Aprobado', 'Reprobado')

df5

      Name  Score  Resultado
0    Alice     80   Aprobado
1      Bob     65  Reprobado
2  Charlie     90   Aprobado

# Ejercicio 14: Eliminar filas con valores atípicos

In [35]:
# Crear un DataFrame de ejemplo
data = {'Value': [10, 15, 20, 25, 200]}
df = pd.DataFrame(data)

# Calcular el rango intercuartílico
Q1 = df['Value'].quantile(0.25)
Q3 = df['Value'].quantile(0.75)
IQR = Q3 - Q1

# Eliminar filas con valores atípicos
eliminar_filas1 = df[(df['Value'] >= Q1 - 1.5 * IQR) & (df['Value'] <= Q3 + 1.5 * IQR)]

eliminar_filas1

   Value
0     10
1     15
2     20
3     25

# Ejercicio 15: Cambiar el formato de una columna de fechas

In [39]:
# Crear un DataFrame de ejemplo
data = {'Fecha': ['2022-01-01', '2022-02-01', '2022-03-01']}
df6 = pd.DataFrame(data)

# Convertir la columna 'Fecha' a formato de fecha
df6["Fecha"] = pd.to_datetime(df6["Fecha"])

df6

       Fecha
0 2022-01-01
1 2022-02-01
2 2022-03-01